In [1]:
#pandas 

import pandas as pd

In [3]:
#pandas Series 

ser=pd.Series([100,'foo',300,'bar',500],['tom','bob','nancy','dan','eric'])

In [4]:
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [5]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [6]:
#accessing 

ser[1]

'foo'

In [7]:
ser['bob']

'foo'

In [8]:
ser[2]=500

In [9]:
ser

tom      100
bob      foo
nancy    500
dan      bar
eric     500
dtype: object

In [10]:
#loc 

ser.loc[['nancy','tom','bob']]

nancy    500
tom      100
bob      foo
dtype: object

In [11]:
ser[[1,2,3]]

bob      foo
nancy    500
dan      bar
dtype: object

In [12]:
ser.iloc[[2,3]]

nancy    500
dan      bar
dtype: object

In [13]:
'tom' in ser

True

In [14]:
'xx' in ser

False

In [15]:
#Data Frame 

d={'one':pd.Series([100,200,300],index=['apple','ball','clock']),
    'two':pd.Series([111,222,333,4444],index=['apple','ball','cerill','dancy'])}

In [16]:
d

{'one': apple    100
 ball     200
 clock    300
 dtype: int64,
 'two': apple      111
 ball       222
 cerill     333
 dancy     4444
 dtype: int64}

In [17]:
df=pd.DataFrame(d)

In [18]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [19]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [20]:
df.columns

Index(['one', 'two'], dtype='object')

In [21]:
data=[{'alex':1,'joe':2},{'ema':5,'dora':10,'alice':20}]

In [22]:
data

[{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [23]:
pd.DataFrame(data)

   alex  joe  ema  dora  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

In [24]:
pd.DataFrame(data,index=['orange','red'])

        alex  joe  ema  dora  alice
orange   1.0  2.0  NaN   NaN    NaN
red      NaN  NaN  5.0  10.0   20.0

In [25]:
pd.DataFrame(data,columns=['joe','ema','alice'])

   joe  ema  alice
0  2.0  NaN    NaN
1  NaN  5.0   20.0

In [26]:
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [27]:
df['two']

apple      111.0
ball       222.0
cerill     333.0
clock        NaN
dancy     4444.0
Name: two, dtype: float64

In [28]:
df['three']=df['one']*df['two']

In [29]:
df

          one     two    three
apple   100.0   111.0  11100.0
ball    200.0   222.0  44400.0
cerill    NaN   333.0      NaN
clock   300.0     NaN      NaN
dancy     NaN  4444.0      NaN

In [30]:
df['flag']=df['two']>=65

In [31]:
df

          one     two    three   flag
apple   100.0   111.0  11100.0   True
ball    200.0   222.0  44400.0   True
cerill    NaN   333.0      NaN   True
clock   300.0     NaN      NaN  False
dancy     NaN  4444.0      NaN   True

In [32]:
df.pop('flag')

apple      True
ball       True
cerill     True
clock     False
dancy      True
Name: flag, dtype: bool

In [33]:
df.insert(1,'copy-of-one',df['one'])

In [34]:
df

          one  copy-of-one     two    three
apple   100.0        100.0   111.0  11100.0
ball    200.0        200.0   222.0  44400.0
cerill    NaN          NaN   333.0      NaN
clock   300.0        300.0     NaN      NaN
dancy     NaN          NaN  4444.0      NaN

In [35]:
import os 

os.chdir('F:\Training Python\ml-latest-small\ml-latest-small')

movies=pd.read_csv('movies.csv')

In [36]:
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [37]:
os.getcwd()

'F:\\Training Python\\ml-latest-small\\ml-latest-small'

In [38]:
ratings=pd.read_csv('ratings.csv')

In [39]:
ratings

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [40]:
tags=pd.read_csv('tags.csv')

In [41]:
tags

      userId  movieId               tag   timestamp
0          2    60756             funny  1445714994
1          2    60756   Highly quotable  1445714996
2          2    60756      will ferrell  1445714992
3          2    89774      Boxing story  1445715207
4          2    89774               MMA  1445715200
...      ...      ...               ...         ...
3678     606     7382         for katie  1171234019
3679     606     7936           austere  1173392334
3680     610     3265            gun fu  1493843984
3681     610     3265  heroic bloodshed  1493843978
3682     610   168248  Heroic Bloodshed  1493844270

[3683 rows x 4 columns]

In [42]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [43]:
row_0=tags.iloc[1]

In [44]:
row_0

userId                     2
movieId                60756
tag          Highly quotable
timestamp         1445714996
Name: 1, dtype: object

In [45]:
row_0.index

Index(['userId', 'movieId', 'tag', 'timestamp'], dtype='object')

In [46]:
'userId' in row_0

True

In [47]:
'xx' in row_0

False

In [48]:
tags.head(10)

   userId  movieId                tag   timestamp
0       2    60756              funny  1445714994
1       2    60756    Highly quotable  1445714996
2       2    60756       will ferrell  1445714992
3       2    89774       Boxing story  1445715207
4       2    89774                MMA  1445715200
5       2    89774          Tom Hardy  1445715205
6       2   106782              drugs  1445715054
7       2   106782  Leonardo DiCaprio  1445715051
8       2   106782    Martin Scorsese  1445715056
9       7    48516       way too long  1169687325

In [49]:
#descriptive stat

ratings['movieId'].describe()

count    100836.000000
mean      19435.295718
std       35530.987199
min           1.000000
25%        1199.000000
50%        2991.000000
75%        8122.000000
max      193609.000000
Name: movieId, dtype: float64

In [50]:
ratings.describe()

              userId        movieId         rating     timestamp
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

In [51]:
ratings['rating'].mean()

3.501556983616962

In [52]:
ratings['rating'].max()

5.0

In [53]:
ratings['rating'].min()

0.5

In [54]:
ratings['rating'].count()

100836

In [55]:
ratings['rating'].std()

1.0425292390605359

In [56]:
movies.shape

(9742, 3)

In [58]:
movies.isnull().any()

movieId    False
title      False
genres     False
dtype: bool

In [59]:
ratings.shape

(100836, 4)

In [60]:
movies[['title','genres']].head(20)

,title,genres
0,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),Adventure|Children|Fantasy
2,Grumpier Old Men (1995),Comedy|Romance
3,Waiting to Exhale (1995),Comedy|Drama|Romance
4,Father of the Bride Part II (1995),Comedy
5,Heat (1995),Action|Crime|Thriller
6,Sabrina (1995),Comedy|Romance
7,Tom and Huck (1995),Adventure|Children
8,Sudden Death (1995),Action
9,GoldenEye (1995),Action|Adventure|Thriller
10,"American President, The (1995)",Comedy|Drama|Romance
11,Dracula: Dead and Loving It (1995),Comedy|Horror
12,Balto (1995),Adventure|Animation|Children
13,Nixon (1995),Drama
14,Cutthroat Island (1995),Action|Adventure|Romance
15,Casino (1995),Crime|Drama
16,Sense and Sensibility (1995),Drama|Romance
17,Four Rooms (1995),Comedy
18,Ace Ventura: When Nature Calls (1995),Comedy
19,Money Train (1995),Action|Comedy|Crime|Drama|Thriller

In [61]:
movies_counts=movies['movieId'].value_counts()

In [63]:
movies_counts.head(10)

86014    1
1282     1
3347     1
1298     1
25870    1
85259    1
1290     1
5384     1
3331     1
3323     1
Name: movieId, dtype: int64

In [66]:
is_comedy=movies['genres'].str.contains('Comedy')

In [67]:
movies[is_comedy]

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
6,7,Sabrina (1995),Comedy|Romance
...,...,...,...
9732,193565,Gintama: The Movie (2010),Action|Animation|Comedy|Sci-Fi
9734,193571,Silver Spoon (2014),Comedy|Drama
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [68]:
is_animation=movies['genres'].str.contains('Animation')

In [69]:
movies[is_animation]

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,13,Balto (1995),Adventure|Animation|Children
44,48,Pocahontas (1995),Animation|Children|Drama|Musical|Romance
205,239,"Goofy Movie, A (1995)",Animation|Children|Comedy|Romance
272,313,"Swan Princess, The (1994)",Animation|Children
...,...,...,...
9733,193567,anohana: The Flower We Saw That Day - The Movi...,Animation|Drama
9735,193573,Love Live! The School Idol Movie (2015),Animation
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation

In [76]:
avg_rating=ratings[['movieId','rating']].groupby('movieId').mean()

In [77]:
avg_rating.head()

           rating
movieId
1        3.920930
2        3.431818
3        3.259615
4        2.357143
5        3.071429

In [72]:
movie_count=ratings[['movieId','rating']].groupby('movieId').count()

In [73]:
movie_count.head()

         rating
movieId
1           215
2           110
3            52
4             7
5            49

In [78]:
tags

      userId  movieId               tag   timestamp
0          2    60756             funny  1445714994
1          2    60756   Highly quotable  1445714996
2          2    60756      will ferrell  1445714992
3          2    89774      Boxing story  1445715207
4          2    89774               MMA  1445715200
...      ...      ...               ...         ...
3678     606     7382         for katie  1171234019
3679     606     7936           austere  1173392334
3680     610     3265            gun fu  1493843984
3681     610     3265  heroic bloodshed  1493843978
3682     610   168248  Heroic Bloodshed  1493844270

[3683 rows x 4 columns]

In [79]:
movies

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [80]:
t=movies.merge(tags,on='movieId',how='inner')

In [81]:
t.head()

,movieId,title,genres,userId,tag,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,336,pixar,1139045764
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,474,pixar,1137206825
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,567,fun,1525286013
3,2,Jumanji (1995),Adventure|Children|Fantasy,62,fantasy,1528843929
4,2,Jumanji (1995),Adventure|Children|Fantasy,62,magic board game,1528843932

In [82]:
t1=movies.merge(tags,on='movieId',how='left')

In [84]:
t1

,movieId,title,genres,userId,tag,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,336.0,pixar,1.139046e+09
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,474.0,pixar,1.137207e+09
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,567.0,fun,1.525286e+09
3,2,Jumanji (1995),Adventure|Children|Fantasy,62.0,fantasy,1.528844e+09
4,2,Jumanji (1995),Adventure|Children|Fantasy,62.0,magic board game,1.528844e+09
...,...,...,...,...,...,...
11848,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,NaN,NaN,NaN
11849,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,NaN,NaN,NaN
11850,193585,Flint (2017),Drama,NaN,NaN,NaN
11851,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,NaN,NaN,NaN
11852,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,NaN,NaN,NaN